####################################################################################
#
# Generated by eda_pt_script.tcl	#1
#              eda_pt_generate.tcl	#1
#              in c:/altera/91sp2/quartus/common/tcl/internal/eda_pt/.
#
# Quartus:  Version 9.1 Build 350 03/24/2010 Service Pack 2 SJ Web Edition
#
# Project:  relogio
# Revision: relogio
# Device:   EP3SE50F484C2
#
# Date: Sun Jun 02 12:18:17 -0300 2013
#
# Copyright (C) 1991-2010 Altera Corporation
#
####################################################################################


##################
# Header Section #
##################

# This Tcl script should be used for PrimeTime (Verilog) only
set report_default_significant_digits 3
set hierarchy_separator .
set quartus_root "c:/altera/91sp2/quartus/"
set search_path [list . [format "%s%s" $quartus_root "eda/synopsys/primetime/lib"] ]
set link_path [list * stratixiii_atoms.db bb2_lib.db  alt_vtl.db]
read_verilog stratixiii_all_pt.v


########################
# Design Entry Section #
########################

read_verilog relogio.vo
current_design relogio
link
set_operating_conditions -analysis_type on_chip_variation
## Use "slow" for slow corner or "fast" for fast corner
set corner slow
if [string equal -nocase $corner slow] {
	read_sdf -analysis_type on_chip_variation relogio_v.sdo
} elseif [string equal -nocase $corner fast] {
	read_sdf -analysis_type on_chip_variation relogio_v_fast.sdo
}
## To remove clock reconvergence pessimism, uncomment the following line:
## set timing_remove_clock_reconvergence_pessimism true


######################
# Timing Constraints #
######################

source relogio.collections.sdc
source relogio.constraints.sdc

########################
# Output Pins Loadings #
########################

# Pin change1 ( Location = C12 )
set_load -pin_load 0 [get_ports { change1 } ]
# Pin change2 ( Location = M22 )
set_load -pin_load 0 [get_ports { change2 } ]
# Pin dez_hora_bcd[0] ( Location = K21 )
set_load -pin_load 0 [get_ports { {dez_hora_bcd[0]} } ]
# Pin dez_hora_bcd[1] ( Location = L20 )
set_load -pin_load 0 [get_ports { {dez_hora_bcd[1]} } ]
# Pin dez_hora_bcd[2] ( Location = A16 )
set_load -pin_load 0 [get_ports { {dez_hora_bcd[2]} } ]
# Pin dez_hora_bcd[3] ( Location = G22 )
set_load -pin_load 0 [get_ports { {dez_hora_bcd[3]} } ]
# Pin dez_hora_bcd[4] ( Location = J21 )
set_load -pin_load 0 [get_ports { {dez_hora_bcd[4]} } ]
# Pin dez_hora_bcd[5] ( Location = J22 )
set_load -pin_load 0 [get_ports { {dez_hora_bcd[5]} } ]
# Pin dez_hora_bcd[6] ( Location = M21 )
set_load -pin_load 0 [get_ports { {dez_hora_bcd[6]} } ]
# Pin dez_min_bcd[0] ( Location = Y15 )
set_load -pin_load 0 [get_ports { {dez_min_bcd[0]} } ]
# Pin dez_min_bcd[1] ( Location = AA16 )
set_load -pin_load 0 [get_ports { {dez_min_bcd[1]} } ]
# Pin dez_min_bcd[2] ( Location = R21 )
set_load -pin_load 0 [get_ports { {dez_min_bcd[2]} } ]
# Pin dez_min_bcd[3] ( Location = P6 )
set_load -pin_load 0 [get_ports { {dez_min_bcd[3]} } ]
# Pin dez_min_bcd[4] ( Location = A17 )
set_load -pin_load 0 [get_ports { {dez_min_bcd[4]} } ]
# Pin dez_min_bcd[5] ( Location = N6 )
set_load -pin_load 0 [get_ports { {dez_min_bcd[5]} } ]
# Pin dez_min_bcd[6] ( Location = N16 )
set_load -pin_load 0 [get_ports { {dez_min_bcd[6]} } ]
# Pin dez_seg_bcd[0] ( Location = T21 )
set_load -pin_load 0 [get_ports { {dez_seg_bcd[0]} } ]
# Pin dez_seg_bcd[1] ( Location = T20 )
set_load -pin_load 0 [get_ports { {dez_seg_bcd[1]} } ]
# Pin dez_seg_bcd[2] ( Location = P7 )
set_load -pin_load 0 [get_ports { {dez_seg_bcd[2]} } ]
# Pin dez_seg_bcd[3] ( Location = W14 )
set_load -pin_load 0 [get_ports { {dez_seg_bcd[3]} } ]
# Pin dez_seg_bcd[4] ( Location = T19 )
set_load -pin_load 0 [get_ports { {dez_seg_bcd[4]} } ]
# Pin dez_seg_bcd[5] ( Location = D16 )
set_load -pin_load 0 [get_ports { {dez_seg_bcd[5]} } ]
# Pin dez_seg_bcd[6] ( Location = R19 )
set_load -pin_load 0 [get_ports { {dez_seg_bcd[6]} } ]
# Pin un_hora_bcd[0] ( Location = M15 )
set_load -pin_load 0 [get_ports { {un_hora_bcd[0]} } ]
# Pin un_hora_bcd[1] ( Location = F20 )
set_load -pin_load 0 [get_ports { {un_hora_bcd[1]} } ]
# Pin un_hora_bcd[2] ( Location = G21 )
set_load -pin_load 0 [get_ports { {un_hora_bcd[2]} } ]
# Pin un_hora_bcd[3] ( Location = K16 )
set_load -pin_load 0 [get_ports { {un_hora_bcd[3]} } ]
# Pin un_hora_bcd[4] ( Location = M16 )
set_load -pin_load 0 [get_ports { {un_hora_bcd[4]} } ]
# Pin un_hora_bcd[5] ( Location = L16 )
set_load -pin_load 0 [get_ports { {un_hora_bcd[5]} } ]
# Pin un_hora_bcd[6] ( Location = L19 )
set_load -pin_load 0 [get_ports { {un_hora_bcd[6]} } ]
# Pin un_min_bcd[0] ( Location = T22 )
set_load -pin_load 0 [get_ports { {un_min_bcd[0]} } ]
# Pin un_min_bcd[1] ( Location = P17 )
set_load -pin_load 0 [get_ports { {un_min_bcd[1]} } ]
# Pin un_min_bcd[2] ( Location = R22 )
set_load -pin_load 0 [get_ports { {un_min_bcd[2]} } ]
# Pin un_min_bcd[3] ( Location = P20 )
set_load -pin_load 0 [get_ports { {un_min_bcd[3]} } ]
# Pin un_min_bcd[4] ( Location = W16 )
set_load -pin_load 0 [get_ports { {un_min_bcd[4]} } ]
# Pin un_min_bcd[5] ( Location = R18 )
set_load -pin_load 0 [get_ports { {un_min_bcd[5]} } ]
# Pin un_min_bcd[6] ( Location = P19 )
set_load -pin_load 0 [get_ports { {un_min_bcd[6]} } ]
# Pin un_seg_bcd[0] ( Location = U2 )
set_load -pin_load 0 [get_ports { {un_seg_bcd[0]} } ]
# Pin un_seg_bcd[1] ( Location = C16 )
set_load -pin_load 0 [get_ports { {un_seg_bcd[1]} } ]
# Pin un_seg_bcd[2] ( Location = AA15 )
set_load -pin_load 0 [get_ports { {un_seg_bcd[2]} } ]
# Pin un_seg_bcd[3] ( Location = Y14 )
set_load -pin_load 0 [get_ports { {un_seg_bcd[3]} } ]
# Pin un_seg_bcd[4] ( Location = N17 )
set_load -pin_load 0 [get_ports { {un_seg_bcd[4]} } ]
# Pin un_seg_bcd[5] ( Location = V15 )
set_load -pin_load 0 [get_ports { {un_seg_bcd[5]} } ]
# Pin un_seg_bcd[6] ( Location = U1 )
set_load -pin_load 0 [get_ports { {un_seg_bcd[6]} } ]
